[
  {
    "Username": "QualityVote",
    "Komentar": "Hi! This is our community moderation bot for `Funny` and `Meme` submissions.\n\n---\n\nIf this post fits /r/indonesia, **UPVOTE** this comment!!\n\nIf this post does not fit the subreddit, **DOWNVOTE** This comment!\n\nIf this post breaks the rules, **DOWNVOTE** this comment and **REPORT** the post!",
    "Komentar_Bersih": "hi this is our community moderation bot for funny and meme submissions if this post fits rindonesia upvote this comment if this post does not fit the subreddit downvote this comment if this post breaks the rules downvote this comment and report the post",
    "sentiment": "netral"
  },
  {
    "Username": "YukkuriOniisan",
    "Komentar": "Since 2020, I buy phones, refrigerator, grocery, even fricking pecel lele pinggir jalan, all by using QRIS. Man, in this few last years QRIS went everywhere... Even small shop in rural Kalimantan had one... The only time I paid cash lately is pom bensin.",
    "Komentar_Bersih": "since i buy phones refrigerator grocery even fricking pecel lele pinggir jalan all by using qris man in this few last years qris went everywhere even small shop in rural kalimantan had one the only time i paid cash lately is pom bensin",
    "sentiment": "netral"
  },
  {
    "Username": "B_kijo",
    "Komentar": "Indomaret gapunya Qris is a fucking blasphemy, siapapun yang nahan Indomaret from implementing QRIS despite more western leaning establishment like Shell already adopting it earlier deserve to be choke slammed from Jalan Layang Antasari.",
    "Komentar_Bersih": "indomaret gapunya qris is a fucking blasphemy nahan indomaret from implementing qris despite more western leaning establishment like shell already adopting it earlier deserve to be choke slammed from jalan layang antasari",
    "sentiment": "positif"
  },
  {
    "Username": "kuuhakuu02",
    "Komentar": "Coba aja di pasar tradisional make QRIS, gak pusing tuh nyari pecahan kembalian wkwkwk",
    "Komentar_Bersih": "coba aja pasar tradisional make qris gak pusing tuh nyari pecah kembali wkwkwk",
    "sentiment": "netral"
  },
  {
    "Username": "VinWilbe",
    "Komentar": "Pengemis sama pengamen udah beberapa yg gw liat pakai QRIS juga.",
    "Komentar_Bersih": "emis amen udah yg gw liat pakai qris",
    "sentiment": "netral"
  },
  {
    "Username": "IvanderGGKEK",
    "Komentar": "Gopay gw kadang ga bisa scan jir panik",
    "Komentar_Bersih": "gopay gw kadang ga scan jir panik",
    "sentiment": "netral"
  },
  {
    "Username": "kevindante6",
    "Komentar": "Bayar parkir pakai kartu kredit.\n\nTruly future that we wanted.\n\nHUTANG PARKIR BAYAR 12 BULAN.",
    "Komentar_Bersih": "bayar parkir pakai kartu kredit truly future that we wanted hutang parkir bayar",
    "sentiment": "netral"
  },
  {
    "Username": "Celestialpha",
    "Komentar": "Idk new banknotes look kinda fire tho",
    "Komentar_Bersih": "idk new banknotes look kinda fire tho",
    "sentiment": "netral"
  },
  {
    "Username": "5yunus2efendi",
    "Komentar": "Mau bayar QRIS di Alfamart suka ditanya balik \"QRIS nya pakai apa kak?\", saya kira QRIS itu untuk semua pembayaran tapi katanya setiap bank punya QRIS masing2 jadi gak bisa nerima QRIS dari bank lain",
    "Komentar_Bersih": "bayar qris alfamart suka qris nya pakai kak qris bayar bank qris gak nerima qris bank",
    "sentiment": "positif"
  },
  {
    "Username": "kudaking13",
    "Komentar": "more importantly, how do you read it?\n\nQRIS? or QRIS?",
    "Komentar_Bersih": "more importantly how do you read it qris or qris",
    "sentiment": "netral"
  },
  {
    "Username": "fabricated_mind",
    "Komentar": "Biaya adminnya bagi merchant mahal ga si?",
    "Komentar_Bersih": "biaya adminnya merchant mahal ga si",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "why?? sometimes i just want to use credit card for cicilan",
    "Komentar_Bersih": "why sometimes i just want to use credit card for cicil",
    "sentiment": "netral"
  },
  {
    "Username": "MonkeDokey",
    "Komentar": "Ditunggu fanfic OP + Qris",
    "Komentar_Bersih": "tunggu fanfic op qris",
    "sentiment": "netral"
  },
  {
    "Username": "Jkt4N",
    "Komentar": "I want nfc payment plssss",
    "Komentar_Bersih": "i want nfc payment plssss",
    "sentiment": "netral"
  },
  {
    "Username": "qornanali",
    "Komentar": "Nanti qris akan support juga qr payment dari luar negeri.",
    "Komentar_Bersih": "qris support qr payment negeri",
    "sentiment": "positif"
  },
  {
    "Username": "Kosaki_MacTavish",
    "Komentar": "Memang gampang sih pakai QRIS karena aplikasi mobile bank tempatku support itu, kemarin pas naik Teman Bis - TJ aja bisa bayar lewat perantara QRIS.",
    "Komentar_Bersih": "gampang sih pakai qris aplikasi mobile bank tempat support kemarin pas teman bis tj aja bayar antara qris",
    "sentiment": "positif"
  },
  {
    "Username": "knightingale2k1",
    "Komentar": "ada toko yg pelit ga mau kena charge 0.7 % per transaksi.",
    "Komentar_Bersih": "toko yg pelit ga kena charge transaksi",
    "sentiment": "netral"
  },
  {
    "Username": "artie_rd",
    "Komentar": "It would be much MUCH better if QRIS doesn't deduct 1% towards the seller, as far as I know thats what driving most people off.",
    "Komentar_Bersih": "it would be much much better if qris doesnt deduct towards the seller as far as i know thats what driving most people off",
    "sentiment": "netral"
  },
  {
    "Username": "notauselessguy_",
    "Komentar": "Qris gang!",
    "Komentar_Bersih": "qris gang",
    "sentiment": "netral"
  },
  {
    "Username": "chariot_dota",
    "Komentar": "Indonesia if e money uses felica instead:",
    "Komentar_Bersih": "indonesia if e money uses felica instead",
    "sentiment": "netral"
  },
  {
    "Username": "DoctorKFC",
    "Komentar": "gw masih nunggu semua vendor cashless bisa nongolin QR supaya bisa discan. mainly gw pake jenius dan MNC bank dan keduanya belon bisa nongolin QR",
    "Komentar_Bersih": "gw nunggu vendor cashless nongolin qr discan mainly gw pake jenius mnc bank belon nongolin qr",
    "sentiment": "netral"
  },
  {
    "Username": "notreal3839399393",
    "Komentar": "Nice try BI for promoting digital rupiah so we will be like china and the gov will cupping our balls 24/7 all year long",
    "Komentar_Bersih": "nice try bi for promoting digital rupiah so we will be like china and the gov will cupping our balls all year long",
    "sentiment": "positif"
  },
  {
    "Username": "eckyp",
    "Komentar": "Really? Kok pengalaman gw sama QRIS clunky bgt ya. Do I use it correctly:\n\n1. Unlock HP\n2. Buka aplikasi + nunggu loading\n3. Scan\n4. Masukin nominal\n5. Confirm\n6. Tunjukin orangnya\n\nDibanding ama kartu:\n\n1. Buka dompet\n2. Kasih kartu + nunggu orangnya operasiin \n3. Masukin pin\n\nDibanding ama NFC / Apple Pay:\n\n1. Tap shortcut HP / Apple Watch (ga perlu unlock)\n2. Deketin ke terminal",
    "Komentar_Bersih": "really alam gw qris clunky bgt ya do i use it correctly unlock hp buka aplikasi nunggu loading scan masukin nominal confirm tunjukin orang banding ama kartu buka dompet kasih kartu nunggu orang operasiin masukin pin banding ama nfc apple pay tap shortcut hp apple watch ga unlock deketin terminal",
    "sentiment": "netral"
  },
  {
    "Username": "Phonixrmf",
    "Komentar": "Pengennya jg kartu debit yg bisa contactless payment ada di mana2",
    "Komentar_Bersih": "ken jg kartu debit yg contactless payment",
    "sentiment": "netral"
  },
  {
    "Username": "sitdowndisco",
    "Komentar": "Cash is still king for me. So much more convenient than qris.",
    "Komentar_Bersih": "cash is still king for me so much more convenient than qris",
    "sentiment": "positif"
  },
  {
    "Username": "Bermainangin",
    "Komentar": "Para pelanggan warung makan saya pun bayar kerupuk 1000rb pkai qriz",
    "Komentar_Bersih": "langgan warung makan bayar kerupuk rb pkai qriz",
    "sentiment": "netral"
  },
  {
    "Username": "Fermi_D2",
    "Komentar": "Ane pernah disuruh bayar pake kartu, karena sinyal di supermarket Hero lagi bobrok pas hujan. Ternyata kelock (ini di bulan2 pasca-covid).\n\nAlhasil, QRIS *to the rescue* meskipun prosesnya agak lama. Ampe sekarang kartu gw belom diganti saking banyaknya merchant yang bisa pake QRIS/GoPay.",
    "Komentar_Bersih": "ane suruh bayar pake kartu sinyal supermarket hero bobrok pas hujan kelock pascacovid alhasil qris to the rescue proses ampe kartu gw bom ganti saking banyak merchant pake qrisgopay",
    "sentiment": "netral"
  },
  {
    "Username": "Dan_from_97",
    "Komentar": "Sebagian toko gk pake qris karena katanya biaya admin dibebankan ke penjual",
    "Komentar_Bersih": "toko gk pake qris biaya admin beban jual",
    "sentiment": "netral"
  },
  {
    "Username": "desktoppc",
    "Komentar": "Sebagai merchant sih ogah bayar 0.7%",
    "Komentar_Bersih": "merchant sih ogah bayar",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "Sudah ada yang pernah ditolak pas bayar pakai uang kertas?",
    "Komentar_Bersih": "tolak pas bayar pakai uang kertas",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "QRIS ini bagus banget asli!\n\nYang bangsat ini adalah e-money/tapcash/dsb yang banyak banget! Seandainya kartu ini cuma ada satu dan bisa topup dari segala mbanking, beh mantap banget bayar apa-apa QRIS terus kalo ga dapet sinyal atau abis batere bisa pake kartu bayar.\n\nSemakin sedikit cash juga IMHO bisa buat ngatasin juru parkir liar",
    "Komentar_Bersih": "qris bagus banget asli bangsat emoneytapcashdsb banget anda kartu topup mbanking beh mantap banget bayar apaapa qris kalo ga dapet sinyal abis batere pake kartu bayar cash imho ngatasin juru parkir liar",
    "sentiment": "positif"
  },
  {
    "Username": "LLYYNN_021",
    "Komentar": "Internet down bengong lu, always bring cash",
    "Komentar_Bersih": "internet down bengong lu always bring cash",
    "sentiment": "netral"
  },
  {
    "Username": "mount_krakatoa",
    "Komentar": "Ntar jadi nya kaya di india dong, uang cash udah di anggap ketingalan jaman",
    "Komentar_Bersih": "ntar nya kaya india uang cash udah anggap ketingalan jaman",
    "sentiment": "netral"
  },
  {
    "Username": "dont_mess_with_tx",
    "Komentar": "Tap to pay is the best. Is that widely available in Indonesia?",
    "Komentar_Bersih": "tap to pay is the best is that widely available in indonesia",
    "sentiment": "positif"
  },
  {
    "Username": "Not_Me_Jerry",
    "Komentar": "What's QRIS ?",
    "Komentar_Bersih": "whats qris",
    "sentiment": "netral"
  },
  {
    "Username": "willpower_11",
    "Komentar": "Inb4 maling zakat QRIS makin merajalela",
    "Komentar_Bersih": "inb maling zakat qris rajalela",
    "sentiment": "netral"
  },
  {
    "Username": "ABugoutBag",
    "Komentar": "Gw lebih suka make cash, mungkin gw paranoid tapi gw ngga suka kalo mayoritas transaksi yg gw lakukin dapet didatain perusahaan/pemerintah",
    "Komentar_Bersih": "gw suka make cash gw paranoid gw ngga suka kalo mayoritas transaksi yg gw lakukin dapet didatain perusahaanpemerintah",
    "sentiment": "positif"
  },
  {
    "Username": "Dewan27",
    "Komentar": "Nah, it just mean the e-wallet or e-banking can hold more your money to disturb again somewhere else /s\n\nPaying with cash is also feels nice, feeling nostalgic and all. Banyak pasar yang masih mengapresiasi bayar cash so why not and why must stop?",
    "Komentar_Bersih": "it just mean the ewallet or ebanking can hold more your money to disturb again somewhere else s paying with cash is also feels nice feeling nostalgic and all pasar apresiasi bayar cash so why not and why must stop",
    "sentiment": "positif"
  },
  {
    "Username": "chinesepepega",
    "Komentar": "What I don't like about QRIS is that I have to scan the QR code and input the price manually. Back when I was studying in China, QR code payments were already the standard everywhere and already replaced cash almost entirely, but what I really like about their system is that every transaction generates a unique QR code that already includes the price. So I just need to scan it and verify with with my fingerprint and that's it, or in some places I just need to show my QR code and they will scan it. Basically it felt more automatic since I didn't need to input a PIN or price.",
    "Komentar_Bersih": "what i dont like about qris is that i have to scan the qr code and input the price manually back when i was studying in china qr code payments were already the standard everywhere and already replaced cash almost entirely but what i really like about their system is that every transaction generates a unique qr code that already includes the price so i just need to scan it and verify with with my fingerprint and thats it or in some places i just need to show my qr code and they will scan it basically it felt more automatic since i didnt need to input a pin or price",
    "sentiment": "positif"
  },
  {
    "Username": "stormatombd",
    "Komentar": "Jokes on you, you must download every different wallet app, bc not all store using same app",
    "Komentar_Bersih": "jokes on you you must download every different wallet app bc not all store using same app",
    "sentiment": "netral"
  },
  {
    "Username": "kunangkunangmalam",
    "Komentar": "So China I guess?",
    "Komentar_Bersih": "so china i guess",
    "sentiment": "netral"
  },
  {
    "Username": "verr998",
    "Komentar": "Most of the stores here use QRIS. And I always pay using QRIS. I don't know it's just less hassle and simple... although for some stuff I still use my CC. hahaha",
    "Komentar_Bersih": "most of the stores here use qris and i always pay using qris i dont know its just less hassle and simple although for some stuff i still use my cc hahaha",
    "sentiment": "netral"
  },
  {
    "Username": "paracematol",
    "Komentar": "Kalo bisa kang parkir pake qris juga, males mecahin duit ui,  sering kelupaan bawa receh.",
    "Komentar_Bersih": "kalo kang parkir pake qris males mecahin duit ui lupa bawa receh",
    "sentiment": "netral"
  },
  {
    "Username": "lazynbroke",
    "Komentar": "QRIS ini ngebantu bgt supaya ga ribet sama kembalian",
    "Komentar_Bersih": "qris ngebantu bgt ga ribet kembali",
    "sentiment": "negatif"
  },
  {
    "Username": "Sovereign66",
    "Komentar": "Sangat membantu kalo lagi kebanyakan uang besar, jadi inget meme beli teh gelas pake duit 100k an, apalagi entah knp skrg yg punya warung pada ogah kalau ngasih kembalian buat 100k pasti ditanya, ada uang kecil gk? like dude, gw ngasih itupun buat nyari uang kecil.",
    "Komentar_Bersih": "bantu kalo banyak uang inget meme beli teh gelas pake duit k an knp skrg yg warung ogah ngasih kembali k uang gk like dude gw ngasih itu nyari uang",
    "sentiment": "positif"
  },
  {
    "Username": "woolucky",
    "Komentar": "pengen lebih sering transaksi cashless tp masih pegang cash terus.. org rumah suka nitip beli ini itu online dan dibalikinnya cash, sdgkan atm setor jarang nemu/jauh (lebih males lg ke teller)",
    "Komentar_Bersih": "ken transaksi cashless tp pegang cash org rumah suka nitip beli online dibalikinnya cash sdgkan atm setor jarang nemujauh males lg teller",
    "sentiment": "positif"
  },
  {
    "Username": "interbingung",
    "Komentar": "kalo buat foreigner yg tidak punya bank account di indonesia, sistem nya gimana ?",
    "Komentar_Bersih": "kalo foreigner yg bank account indonesia sistem nya gimana",
    "sentiment": "netral"
  },
  {
    "Username": "archeryon",
    "Komentar": "Experienced this 6 years ago when studying in china. Never bother to bring wallet at all. Wechat pay is all you need. Indonesia still had a long way to go",
    "Komentar_Bersih": "experienced this years ago when studying in china never bother to bring wallet at all wechat pay is all you need indonesia still had a long way to go",
    "sentiment": "netral"
  },
  {
    "Username": "kyuc",
    "Komentar": "If all banks have qris",
    "Komentar_Bersih": "if all banks have qris",
    "sentiment": "netral"
  },
  {
    "Username": "urboy008",
    "Komentar": "Cashless is the way",
    "Komentar_Bersih": "cashless is the way",
    "sentiment": "netral"
  },
  {
    "Username": "Mlrk3y",
    "Komentar": "u/WheresWalldough",
    "Komentar_Bersih": "uwhereswalldough",
    "sentiment": "netral"
  },
  {
    "Username": "telorpete",
    "Komentar": "mulai pake qris sejak mobilebca dah bisa qris. dah gak perlu lagi setor duit ke app pihak ketiga buat bayar2. lsg aja dari bank -> merchant. gampang banget.\n\nkecuali steam/jasa2 luar negeri ya tetep visa/mastercard.",
    "Komentar_Bersih": "pake qris mobilebca dah qris dah gak setor duit app tiga bayar lsg aja bank merchant gampang banget kecuali steamjasa negeri ya tetep visamastercard",
    "sentiment": "netral"
  },
  {
    "Username": "yusnandaP",
    "Komentar": "Coba kalau ada QRIS tanpa KYC buat buyer.",
    "Komentar_Bersih": "coba qris kyc buyer",
    "sentiment": "netral"
  },
  {
    "Username": "bleedblue_knetic",
    "Komentar": "Industry players hate it karena kebagian sedikit banget.",
    "Komentar_Bersih": "industry players hate it bagi banget",
    "sentiment": "negatif"
  },
  {
    "Username": "AnantaWijaya",
    "Komentar": "kiris",
    "Komentar_Bersih": "kiris",
    "sentiment": "netral"
  },
  {
    "Username": "Viperia26",
    "Komentar": "Masih ada juga tempat yang udah pake QRIS tapi minimum payment 50k, rese banget kalo gue cuma beli kopi 30k ya ujung ujungnya harus pake cash",
    "Komentar_Bersih": "udah pake qris minimum payment k rese banget kalo gue beli kopi k ya ujung ujung pake cash",
    "sentiment": "netral"
  },
  {
    "Username": "davinzt",
    "Komentar": "umur panjang untuk orang2 yang bikin qris, truly legendary",
    "Komentar_Bersih": "umur orang bikin qris truly legendary",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "Gue udah lama banget ga ambil duit di atm, duit di dompet paling selembar doang. Ke warteg aja udah bisa pake qris",
    "Komentar_Bersih": "gue udah banget ga ambil duit atm duit dompet lembar doang warteg aja udah pake qris",
    "sentiment": "netral"
  },
  {
    "Username": "kejok",
    "Komentar": "my nearest abang nasi goreng terima qris.",
    "Komentar_Bersih": "my nearest abang nasi goreng terima qris",
    "sentiment": "netral"
  },
  {
    "Username": "visual-vomit",
    "Komentar": "Q-ris > Kris\n\nChange my mind.",
    "Komentar_Bersih": "qris kris change my mind",
    "sentiment": "netral"
  },
  {
    "Username": "ColdOffice",
    "Komentar": "i live in kabupaten, monthly salary 10mil, never use qris even once, using kartu kredit also taxxed for 2k, in rural cash or debit still better",
    "Komentar_Bersih": "i live in kabupaten monthly salary mil never use qris even once using kartu kredit also taxxed for k in rural cash or debit still better",
    "sentiment": "netral"
  },
  {
    "Username": "motoxim",
    "Komentar": "Masih suka cash saya",
    "Komentar_Bersih": "suka cash",
    "sentiment": "positif"
  },
  {
    "Username": "dogemonero",
    "Komentar": "If u want mass adoption on qris just fkin delete mdr or set standard fee 1000 idr, rn it fkin expensive 0.7% from total transaction meanwhile u only profit 0.3/0.4 per transaction.",
    "Komentar_Bersih": "if u want mass adoption on qris just fkin delete mdr or set standard fee idr rn it fkin expensive from total transaction meanwhile u only profit transaction",
    "sentiment": "netral"
  },
  {
    "Username": "XylanyX",
    "Komentar": "so true, so easy to use",
    "Komentar_Bersih": "so true so easy to use",
    "sentiment": "positif"
  },
  {
    "Username": "Alif_prakoso17",
    "Komentar": "Street vendors and warungs that accepts QRIS win-win banget imo\n\nYang beli gaperlu buka dompet, yang jual gaperlu ribet ngurus kembalian",
    "Komentar_Bersih": "street vendors and warungs that accepts qris winwin banget imo beli gaperlu buka dompet jual gaperlu ribet ngurus kembali",
    "sentiment": "negatif"
  },
  {
    "Username": "niftygrid",
    "Komentar": "I also use QRIS a lot lately, like in restaurants, mall merchants, etc\nI'm yet to see QRIS being used by minimarkets though.. they still don't accept QRIS because they use other form of payment (especially indomaret, never tried qris in alfamart though..)",
    "Komentar_Bersih": "i also use qris a lot lately like in restaurants mall merchants etc im yet to see qris being used by minimarkets though they still dont accept qris because they use other form of payment especially indomaret never tried qris in alfamart though",
    "sentiment": "positif"
  },
  {
    "Username": "FengLengshun",
    "Komentar": "I hate how fucking heavy these QR apps are, though.\n\nThe worst one for me is Jenius, which sucks because they have PayLater available for all QR transaction.\n\nGoPay is less bad, but it's still annoying. BCA, even with the QR shortcut icon, sometimes you get to the QR UI and sometimes you get redirected to the normal UI, both case still has to deal with passwords and \"wait for green light\" first (but worse in the normal UI).\n\nHaven't used LinkAja, Grab (installing OVO as well feels redundant but at least they have a less \"super app\" heavy version), or DANA in a while, but I still have 30-50k in them for backup. DANA was sorta the \"best\" because they integrate with Samsung Pay, and that is so much faster. But I really don't want to manage more than 2 wallets man.",
    "Komentar_Bersih": "i hate how fucking heavy these qr apps are though the worst one for me is jenius which sucks because they have paylater available for all qr transaction gopay is less bad but its still annoying bca even with the qr shortcut icon sometimes you get to the qr ui and sometimes you get redirected to the normal ui both case still has to deal with passwords and wait for green light first but worse in the normal ui havent used linkaja grab installing ovo as well feels redundant but at least they have a less super app heavy version or dana in a while but i still have k in them for backup dana was sorta the best because they integrate with samsung pay and that is so much faster but i really dont want to manage more than wallets man",
    "sentiment": "negatif"
  },
  {
    "Username": "geefar",
    "Komentar": "Di jogja udah banyak yg qris",
    "Komentar_Bersih": "jogja udah yg qris",
    "sentiment": "netral"
  },
  {
    "Username": "uceenk",
    "Komentar": "kalian pake QRIS pake app apa ?,  gwe ngandelin jenius lama buka QRIS nya, pake QRIS di gojek pun males karena suka ga ada saldo\n\npembayaran di merchant seringnya masih pake kartu debit BCA atau cash",
    "Komentar_Bersih": "pake qris pake app gwe ngandelin jenius buka qris nya pake qris gojek males suka ga saldo bayar merchant pake kartu debit bca cash",
    "sentiment": "positif"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "e-wallet QRIS terbaik adalah gojek karena bisa pake faceid",
    "Komentar_Bersih": "ewallet qris baik gojek pake faceid",
    "sentiment": "positif"
  },
  {
    "Username": "cobapedas",
    "Komentar": "I should back to Pontianak,open KiosBensin+TampalBan and accepting Qris payment.",
    "Komentar_Bersih": "i should back to pontianakopen kiosbensintampalban and accepting qris payment",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "[deleted]",
    "Komentar_Bersih": "deleted",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Qris ada limit per transaksinya, tahun 2020 masih 2juta doang. Mana bisa beli hape/kulkas…",
    "Komentar_Bersih": "qris limit transaksi juta doang beli hapekulkas",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "damn fridge???  \n\n\ntbh im glad QRIS is adopted quickly by all e money vendor, its so breeze not to deal with splitting e-money, although i still need gopay for gofood sometimes and indomaret",
    "Komentar_Bersih": "damn fridge tbh im glad qris is adopted quickly by all e money vendor its so breeze not to deal with splitting emoney although i still need gopay for gofood sometimes and indomaret",
    "sentiment": "netral"
  },
  {
    "Username": "fendytan",
    "Komentar": "Kalau pom bensin nya punya mesin EDC mandiri dkk, itu kan bisa generate qris. Saya pernah juga di pom bensin.",
    "Komentar_Bersih": "pom bensin nya mesin edc mandiri dkk generate qris pom bensin",
    "sentiment": "netral"
  },
  {
    "Username": "Few-Coyote-2518",
    "Komentar": "jadi inget pernah lihat pengamen di pinggir jalan, ada barcode QRIS di gitarnya.. ga tahu itu beneran atau cuman pajangan.",
    "Komentar_Bersih": "inget lihat amen pinggir jalan barcode qris gitar ga beneran cuman pajang",
    "sentiment": "netral"
  },
  {
    "Username": "arytapermana",
    "Komentar": "Remember kids, not all QRIS is QRIS, sometimes they didn't accept other bank or other digital payment, at least you have 4 banks and 4 digital wallet accounts.",
    "Komentar_Bersih": "remember kids not all qris is qris sometimes they didnt accept other bank or other digital payment at least you have banks and digital wallet accounts",
    "sentiment": "netral"
  },
  {
    "Username": "Anakacuk",
    "Komentar": "Even beli pentol di kampung halaman saya di kalimantan, bisa pake qris, malah di jogja kadang di tempat yang hits, ga bisa pake qris",
    "Komentar_Bersih": "even beli pentol kampung halaman kalimantan pake qris jogja kadang hits ga pake qris",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "the last nail in the coffin for mainstream QRIS adoption",
    "Komentar_Bersih": "the last nail in the coffin for mainstream qris adoption",
    "sentiment": "netral"
  },
  {
    "Username": "dhilzyi",
    "Komentar": "iirc Indomaret punya isaku jadi e payment utama mungkin?mereka ga mau ada saingan or some shit",
    "Komentar_Bersih": "iirc indomaret isa e payment utama mungkinmereka ga saing or some shit",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Denger2 sih krn sistem POSnya di domar yang kuno jadi susah buat integrasinya. Ga usah jauh2 QRIS, kartu debit/kredit aja kalo pake kartu yang BINnya belum terdaftar (untuk identifikasi penerbit dan jenis kartu) nggak bisa. Kayak contoh pake kartu luar negri gitu meskipun yg berlogo visa maupun mastercard ga bakal bisa.",
    "Komentar_Bersih": "denger sih krn sistem pos domar kuno susah integrasi ga qris kartu debitkredit aja kalo pake kartu bin daftar identifikasi terbit jenis kartu nggak kayak contoh pake kartu negri gitu yg logo visa mastercard ga",
    "sentiment": "netral"
  },
  {
    "Username": "jayneralkenobi",
    "Komentar": "Alfa has Qris that's why I go to alfa nowadays",
    "Komentar_Bersih": "alfa has qris thats why i go to alfa nowadays",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Lol justru Indomaretnya yang ga mau pake QRIS karena mereka ga mau kena MDR 0.7%",
    "Komentar_Bersih": "lol indomaretnya ga pake qris ga kena mdr",
    "sentiment": "netral"
  },
  {
    "Username": "imakin",
    "Komentar": "OVO pay yang ada di indomaret QRIS compatible gak ya?",
    "Komentar_Bersih": "ovo pay indomaret qris compatible gak ya",
    "sentiment": "netral"
  },
  {
    "Username": "elonelon",
    "Komentar": "bisa pake barcode, gue pake gopay mulu.\n\nrata2 alfa yang tak kunjungi di kota maupun desa deket rumah mereka gak paham cara bayar pake gopay. Pernah gue mo pake gopay, nunggu 5 menit gak bisa, akhirnya cash.",
    "Komentar_Bersih": "pake barcode gue pake gopay mulu alfa kunjung kota desa deket rumah gak paham bayar pake gopay gue mo pake gopay nunggu menit gak cash",
    "sentiment": "netral"
  },
  {
    "Username": "silent-screamer",
    "Komentar": "at least they accept gopay and since I'm a gopay main that's a win for me",
    "Komentar_Bersih": "at least they accept gopay and since im a gopay main thats a win for me",
    "sentiment": "netral"
  },
  {
    "Username": "Lev22_",
    "Komentar": "Makanya skrg aku balik ke Alfamart karena ini, setelah bertahun2 selalu ke Indomaret",
    "Komentar_Bersih": "skrg alfamart tahun indomaret",
    "sentiment": "netral"
  },
  {
    "Username": "lsthelsjfeq",
    "Komentar": "Gw di Malaysia, lucunya di sini tuh kedai2 runcit (corner shop) kecil2an sini bnyk yg udh menerima pembayaran lewat QR code, tp di bnyk tempat minimarket2 waralaba kyk 7-11 justru gk bisa 🤷",
    "Komentar_Bersih": "gw malaysia lucu tuh kedai runcit corner shop kecil bnyk yg udh terima bayar qr code tp bnyk minimarket waralaba kyk gk",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Seperti yg sudah dijawab, di pasar tradisional skrg juga ga main recehan lagi. Semua dibuletin. Malah sering jg kayak belanja 33rb trus ditawarin “ininya tak tambahin aja ya, jadi supaya pas 35rb”",
    "Komentar_Bersih": "yg pasar tradisional skrg ga main receh buletin jg kayak belanja rb trus ditawarin ini tambahin aja ya pas rb",
    "sentiment": "netral"
  },
  {
    "Username": "lebaran",
    "Komentar": "Kalau di daerah saya pedagang pasar tradisional udah gak mau terima duit koinan < Rp1000.",
    "Komentar_Bersih": "daerah dagang pasar tradisional udah gak terima duit koin rp",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "[removed]",
    "Komentar_Bersih": "removed",
    "sentiment": "netral"
  },
  {
    "Username": "rulakhy",
    "Komentar": "Gw beberapa kali lewat Pasar Demangan Jogja, ada spanduk gede kalau pedagangnya udah pada nerima QRIS, providernya Bank BPD DIY kalau ga salah",
    "Komentar_Bersih": "gw kali pasar demang jogja spanduk gede dagang udah nerima qris providernya bank bpd diy ga salah",
    "sentiment": "netral"
  },
  {
    "Username": "TelecomVsOTT",
    "Komentar": "Gua pernah malam2 belanja di toko kelontong, nawar bayar pakai transfer. Si penjaga toko gak mau karena besok nya dia butuh uang cash untuk belanja2 barang dagangan. Gue yakin pasar tradisional merasakan hal yang sama.\n\nJadi harus dari hulu dulu (toko wholesaler dll) yang memulai cashless baru ke hilirnya (toko2 kecil) bisa ikut menerapkan juga.",
    "Komentar_Bersih": "gua malam belanja toko kelontong nawar bayar pakai transfer si jaga toko gak besok nya butuh uang cash belanja barang dagang gue pasar tradisional rasa hulu toko wholesaler dll cashless hilir toko terap",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "![gif](giphy|11mwI67GLeMvgA)",
    "Komentar_Bersih": "gifgiphymwiglemvga",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "layar rusak?",
    "Komentar_Bersih": "layar rusak",
    "sentiment": "netral"
  },
  {
    "Username": "amememex",
    "Komentar": "Kirain gw doang, dari semua app yg support qris cuma gopay yg agak oon ngescan nya. Harus di restart app dulu baru bisa.",
    "Komentar_Bersih": "kirain gw doang app yg support qris gopay yg oon ngescan nya restart app",
    "sentiment": "positif"
  },
  {
    "Username": "gunjinganpakis",
    "Komentar": "Kalau gw yang pusing bisa Scan tapi pilihan gopaylater nya yang gak bisa 😦",
    "Komentar_Bersih": "gw pusing scan pilih gopaylater nya gak",
    "sentiment": "netral"
  },
  {
    "Username": "sadbot0001",
    "Komentar": "Gue mah gak muluk-muluk. minimal semua parkir bisa nerima emoney atau ewallet dulu aja deh.",
    "Komentar_Bersih": "gue mah gak mulukmuluk minimal parkir nerima emoney ewallet aja deh",
    "sentiment": "netral"
  },
  {
    "Username": "elonelon",
    "Komentar": "awas, harusnya uang parkir masuk ke kas daerah eh nanti malah masuk ke kantong pribadi.",
    "Komentar_Bersih": "awas uang parkir masuk kas daerah eh masuk kantong pribadi",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Bukan gitu.\n\nAlfamart dan Indomaret itu ga pake QRIS, tapi pake token payment. Jadi kalo lu liat di OVO, Gopay dsb, itu ada QRIS dan ada Barcode, nah kalo Barcode itu sistemnya token dan pairing jadi tiap tiap app punya Auth server sendiri.\n\nIni siasat si ewallet dan minimarket biar tarif MDR ga ikut 0.7%. Mungkin lebih rendah, dan harusnya lebih rendah.\n\nJadi jangan ketipu. Lu bayar di Indomaret dan Alfamart, kalo pake \"Kode Bayar\" atau Token itu berarti lu ga bayar pake QRIS",
    "Komentar_Bersih": "gitu alfamart indomaret ga pake qris pake token payment kalo lu liat ovo gopay dsb qris barcode kalo barcode sistem token pairing app auth server siasat si ewallet minimarket biar tarif mdr ga rendah rendah tipu lu bayar indomaret alfamart kalo pake kode bayar token lu ga bayar pake qris",
    "sentiment": "netral"
  },
  {
    "Username": "slavengineer",
    "Komentar": "Itu dulu pas BCA masih ngeluarin QR sendiri, ama org kasirnya kurang ngerti aja. Sekarang mah mau Gopay ama QRIS sama aja kok QR codenya. Perhatiin biasanya ada logo GPN.",
    "Komentar_Bersih": "pas bca ngeluarin qr ama org kasir ngerti aja mah gopay ama qris aja qr codenya perhatiin logo gpn",
    "sentiment": "netral"
  },
  {
    "Username": "Phonixrmf",
    "Komentar": "QRIS",
    "Komentar_Bersih": "qris",
    "sentiment": "netral"
  },
  {
    "Username": "lebaran",
    "Komentar": "0.7% untuk transaksi reguler. Setiap transaksi Rp1000, merchantnya kepotong Rp7. Tapi sekarang ini untuk usaha mikro masih free MDR nya sampai Juni 2023 kalau nggak salah.\n\n0.6% untuk transaksi yang berkaitan dengan pendidikan (bayar spp/semesteran misalnya).\n\n0.4% untuk transaksi di SPBU. \n\n0% untuk sosial (bansos atau sumbangan)",
    "Komentar_Bersih": "transaksi reguler transaksi rp merchantnya potong rp usaha mikro free mdr nya juni nggak salah transaksi kait didik bayar sppsemesteran transaksi spbu sosial bansos sumbang",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Skrg bbrp bank mulai menyediakan fitur qris dengan sumber dana credit card sih. Setau gw yg udah bisa ada cimb niaga, mandiri, bri, sama citibank.",
    "Komentar_Bersih": "skrg bbrp bank sedia fitur qris sumber dana credit card sih tau gw yg udah cimb niaga mandiri bri citibank",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "I don't think I would use QRIS for transaction above 500k either lmao",
    "Komentar_Bersih": "i dont think i would use qris for transaction above k either lmao",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Not this kind of \"like\" lolololol",
    "Komentar_Bersih": "not this kind of like lolololol",
    "sentiment": "positif"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "welp all smartphone have camera but not NFC  \n\n\nalso tech using QR is easier to adopt and applied, compared to NFC based",
    "Komentar_Bersih": "welp all smartphone have camera but not nfc also tech using qr is easier to adopt and applied compared to nfc based",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Setuju, menurut gw problem nomer satu QRIS itu ketergantungan sinyal/koneksi internet, yg notabene masih spotty apalagi di daerah non kota besar. Sayangnya kayaknya Apple/Samsung Pay di sini masih sekedar angan2. Bank2 lebih milih menyematkan fitur contactless di kartunya itu sendiri. Baby steps.",
    "Komentar_Bersih": "tuju gw problem nomer qris gantung sinyalkoneksi internet yg notabene spotty daerah non kota sayang kayak applesamsung pay dar angan bank milih semat fitur contactless kartu baby steps",
    "sentiment": "negatif"
  },
  {
    "Username": "loveact",
    "Komentar": "tcash beberapa tahun lalu",
    "Komentar_Bersih": "tcash",
    "sentiment": "netral"
  },
  {
    "Username": "LicheXam",
    "Komentar": "Secomd this i prefer google pay or apple pay",
    "Komentar_Bersih": "secomd this i prefer google pay or apple pay",
    "sentiment": "netral"
  },
  {
    "Username": "DutyCorp",
    "Komentar": "Bukan nanti, sudah. [Baru tadi pagi press release QRIS bisa Cross Border dengan DuitNow QR punya Malaysia](https://www.cnnindonesia.com/ekonomi/20230508110110-78-946615/belanja-di-malaysia-bisa-pakai-rupiah-via-qris-mulai-hari-ini) setelah [sebelumnya bisa cross border dengan Thai QR di Thailand ](https://money.kompas.com/read/2022/09/01/110000226/qris-bisa-digunakan-di-thailand-ini-daftar-merchant-dan-aplikasinya?page=all)",
    "Komentar_Bersih": "pagi press release qris cross border duitnow qr malaysia cross border thai qr thailand",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "TJ bayar QRIS langsung di bis nya bro?? Still allow cash no?",
    "Komentar_Bersih": "tj bayar qris langsung bis nya bro still allow cash no",
    "sentiment": "netral"
  },
  {
    "Username": "kangtuji",
    "Komentar": "0.7 %.... \n\nbayar 100.000\n\ndapet 30.000 doang sisanya buat bayar charge\n\nper transaksi",
    "Komentar_Bersih": "bayar dapet doang sisa bayar charge transaksi",
    "sentiment": "netral"
  },
  {
    "Username": "beelzebub-rising",
    "Komentar": "Ya teknologinya nda gratis mz. Server cost, maintenance, tech debt, staff juga perlu dibayar toh. 0.7% yang dicharge QRIS masih jauh lebih rendah kalau dibandingin ama VISA, Mastercard. Dan ini termasuk perbandingan yang cukup setara, karena sama2 payment processor. QRIS jg udh mulai ekspansi ke 4 negara tetangga.",
    "Komentar_Bersih": "ya teknologi nda gratis mz server cost maintenance tech debt staff bayar dicharge qris rendah dibandingin ama visa mastercard banding tara payment processor qris jg udh ekspansi negara tetangga",
    "sentiment": "netral"
  },
  {
    "Username": "plentongreddit",
    "Komentar": "Cash\n\n1. Kasih uang sesui nominal atau mendekati\n2. Terima kembalian/kembalian untuk tips(optional)",
    "Komentar_Bersih": "cash kasih uang sesui nominal dekat terima kembaliankembalian tipsoptional",
    "sentiment": "netral"
  },
  {
    "Username": "volcia",
    "Komentar": "Qris itu kompromi antara penjual dan pembeli. Penjual gak perlu modal banyak nyediain nfc/card reader (tinggal print) dan pembeli gak perlu ngambil cash (tinggal scan).\n\nIdealnya sih penjual nerima cash, kartu, nfc, sama qris lol",
    "Komentar_Bersih": "qris kompromi jual beli jual gak modal nyediain nfccard reader tinggal print beli gak ngambil cash tinggal scan ideal sih jual nerima cash kartu nfc qris lol",
    "sentiment": "netral"
  },
  {
    "Username": "Much_Oil9487",
    "Komentar": "Yg bikin sebel itu semua app maunya jadi super apps, jadi kebykan fiturnya dan bikin loading pas buka appnya makin lama, tapi yah demi profit jg mereka bikin fitur byk ky gitu\n\nKl ky apple pay n google pay kan bener2 cuma buat payment no bullshit feature",
    "Komentar_Bersih": "yg bikin sebel app mau super apps kebykan fiturnya bikin loading pas buka appnya yah profit jg bikin fitur byk ky gitu kl ky apple pay n google pay bener payment no bullshit feature",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "pake mbca, \n\nHOLD UP!  \n\n\ntunggu status indikator hijau...",
    "Komentar_Bersih": "pake mbca hold up tunggu status indikator hijau",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Tbh with you bro, I'm too poor for having phone with NFC, and too clumsy for having another card that might be missing, so forgive me\n\nThis is just a meme too, don't take it too serious kay\n\nTHIS ONE IS MY CASE, most of the time the QRIS method 6 is skipped in my case, also i use face recognition for unlock so step 1 is kinda..... neglectable",
    "Komentar_Bersih": "tbh with you bro im too poor for having phone with nfc and too clumsy for having another card that might be missing so forgive me this is just a meme too dont take it too serious kay this one is my case most of the time the qris method is skipped in my case also i use face recognition for unlock so step is kinda neglectable",
    "sentiment": "negatif"
  },
  {
    "Username": "Reverse_Necromancer",
    "Komentar": "Yaelah step 5 sama 6 itu negligible cuy, sama aja kaya pencet confirm di mesin kartu dan kasir kasih struk. Step lebihnya cuma masukkin nominal dan itu pun kasir juga harus masukkin. \n\nPlus, step 2 kartu itu kadang lama banget. tambah step lagi, masukkin kartu ke dompet yang perlu 2 tangan",
    "Komentar_Bersih": "yaelah step negligible cuy aja kaya pencet confirm mesin kartu kasir kasih struk step lebih masukkin nominal kasir masukkin plus step kartu kadang banget step masukkin kartu dompet tangan",
    "sentiment": "netral"
  },
  {
    "Username": "lebaran",
    "Komentar": "Transaksi yang paling cepet itu kasbon, lebih cepet dari cash malah.",
    "Komentar_Bersih": "transaksi cepet kasbon cepet cash",
    "sentiment": "netral"
  },
  {
    "Username": "ReapBoyz",
    "Komentar": "gw sendiri sebenarnya lebih suka QRIS untuk menghindari penarikan uang rupiah karena gw boros kalo di dompet ada rupiah wkwkwk",
    "Komentar_Bersih": "gw suka qris hindar tari uang rupiah gw boros kalo dompet rupiah wkwkwk",
    "sentiment": "positif"
  },
  {
    "Username": "davidse7en",
    "Komentar": "Wah restoran mana ini krupuk 1 juta",
    "Komentar_Bersih": "restoran krupuk juta",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Kayaknya kebalik nih. Qris kan malah dependent banget sama internet. Kalo pakai kartu/contactless tergantung edc si merchant kalo yg pake kabel telpon/ethernet ya ga masalah kalo ga ada sinyal jg",
    "Komentar_Bersih": "kayak balik nih qris dependent banget internet kalo pakai kartucontactless gantung edc si merchant kalo yg pake kabel telponethernet ya ga kalo ga sinyal jg",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "I think that's a common sense bro",
    "Komentar_Bersih": "i think thats a common sense bro",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "Is that even a problem?",
    "Komentar_Bersih": "is that even a problem",
    "sentiment": "negatif"
  },
  {
    "Username": "Loading_Internet",
    "Komentar": "Satu satunya yg masih selamat ya Kantin sekolah 🗿",
    "Komentar_Bersih": "satu yg selamat ya kantin sekolah",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Org india bangga banget sama sistem UPI mereka",
    "Komentar_Bersih": "org india bangga banget sistem upi",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Nah, mainly due to not all phone here have NFC, mine included\n\nAlso tap to pay isn't as accessible as QR for small business",
    "Komentar_Bersih": "mainly due to not all phone here have nfc mine included also tap to pay isnt as accessible as qr for small business",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Such system in QRIS exist if the merchant use EDC to provide the QR\n\nThe printed QR is used for small to medium store and restaurant like lesehan who can't invest in EDC",
    "Komentar_Bersih": "such system in qris exist if the merchant use edc to provide the qr the printed qr is used for small to medium store and restaurant like leseh who cant invest in edc",
    "sentiment": "positif"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Yang lu sebut semua udah ready. Cuma ga diimplementasikan ama yang jual.",
    "Komentar_Bersih": "lu udah ready ga implementasi ama jual",
    "sentiment": "netral"
  },
  {
    "Username": "sadbot0001",
    "Komentar": "I only experienced that in alfamart. Indomaret, OTOH, just ask me to show my QRIS (im using Livin by Mandiri) and then they will scan my QRIS to complete the payment. No need to type in any number at all.",
    "Komentar_Bersih": "i only experienced that in alfamart indomaret otoh just ask me to show my qris im using livin by mandiri and then they will scan my qris to complete the payment no need to type in any number at all",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Kode Bayar / Token is not QRIS. Indomaret and Alfamart are notorious for this practice.",
    "Komentar_Bersih": "kode bayar token is not qris indomaret and alfamart are notorious for this practice",
    "sentiment": "netral"
  },
  {
    "Username": "Codenameaswin",
    "Komentar": "bukannya qris udah semua nerima bank sama e-money",
    "Komentar_Bersih": "qris udah nerima bank emoney",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Idk if China making sort of standard for it's e-money thing\n\nDo they?",
    "Komentar_Bersih": "idk if china making sort of standard for its emoney thing do they",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Idk bout you, ku sebel bgt sama kebanyakan kang parkir disini. Keluarin sendiri, nyebrang sendiri, gak dikasih duit dikatain\n\nAlso kang parkir in Indomaret, that type is the worst",
    "Komentar_Bersih": "idk bout you ku sebel bgt banyak kang parkir keluarin nyebrang gak kasih duit dikatain also kang parkir in indomaret that type is the worst",
    "sentiment": "negatif"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Also cash bulk, and easy tracking what impulse purchase i did",
    "Komentar_Bersih": "also cash bulk and easy tracking what impulse purchase i did",
    "sentiment": "positif"
  },
  {
    "Username": "sadbot0001",
    "Komentar": "But then kita jadi gak ada duit receh buat bayar kang parkir. Wkwkwkwk",
    "Komentar_Bersih": "but then gak duit receh bayar kang parkir wkwkwkwk",
    "sentiment": "netral"
  },
  {
    "Username": "WheresWalldough",
    "Komentar": "opo?",
    "Komentar_Bersih": "opo",
    "sentiment": "netral"
  },
  {
    "Username": "FengLengshun",
    "Komentar": "Key-Are-Eee-S is better and clearer. Change my mind.",
    "Komentar_Bersih": "keyareeees is better and clearer change my mind",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Aku langsung di aplikasi Blu, itu BCA digital kalo Ndak tau\n\nJadi langsung ditarik dari rekening, sama masih bisa buat tarik tunai di ATM BCA biasa\n\nIbuku pake mbca kayakny",
    "Komentar_Bersih": "langsung aplikasi blu bca digital kalo ndak tau langsung tarik rekening tarik tunai atm bca ibu pake mbca kayakny",
    "sentiment": "netral"
  },
  {
    "Username": "Bunation",
    "Komentar": "Tampal\" ban?",
    "Komentar_Bersih": "tampal ban",
    "sentiment": "netral"
  },
  {
    "Username": "raumdeuters",
    "Komentar": "Shell ftw",
    "Komentar_Bersih": "shell ftw",
    "sentiment": "netral"
  },
  {
    "Username": "azizaja595",
    "Komentar": "Pertamina with their stupid MyPertamina app and not letting anyone paying freely with QRIS",
    "Komentar_Bersih": "pertamina with their stupid mypertamina app and not letting anyone paying freely with qris",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Mypertamina kan udah bisa pake linkaja/ovo.",
    "Komentar_Bersih": "mypertamina udah pake linkajaovo",
    "sentiment": "netral"
  },
  {
    "Username": "PeterTheSad",
    "Komentar": "gue disini kalo ke pertashop, bisa pake qris kok. coba aja tanya bisa atau engga kalo di pertashop ya tp, kalo pertamina biasa gatau sihh",
    "Komentar_Bersih": "gue kalo pertashop pake qris coba aja engga kalo pertashop ya tp kalo pertamina gatau sihh",
    "sentiment": "netral"
  },
  {
    "Username": "Green_Fig2564",
    "Komentar": "FYI, kalau bilang ke abangnya pom bensin PTMN mau bayarpake qris, sekarang udah bisa kok. Ini pun gw baru tahu sebulan yang lalu. Nanti dikasih struk qrisnya",
    "Komentar_Bersih": "fyi bilang abang pom bensin ptmn bayarpake qris udah gw bulan kasih struk qrisnya",
    "sentiment": "netral"
  },
  {
    "Username": "YukkuriOniisan",
    "Komentar": "*Shrug* I bought the fridge just last week. Remember 'since 2020', not 'in 2020', due to COVID, I hardly went to cash shop or ATM or bank and my wage switched to bank transfers. Hence why I mostly used QRIS then. \n\nI bought phones in 2021 (Poco X3) and 2023 (Note 12 Pro).\n\nI am only aware that the limit is 10 million per transaction.\n\nIf anyone asked, I mostly used QRIS BRI and OVO.",
    "Komentar_Bersih": "shrug i bought the fridge just last week remember since not in due to covid i hardly went to cash shop or atm or bank and my wage switched to bank transfers hence why i mostly used qris then i bought phones in poco x and note pro i am only aware that the limit is million transaction if anyone asked i mostly used qris bri and ovo",
    "sentiment": "netral"
  },
  {
    "Username": "reloc8d",
    "Komentar": "anjay orkay nih.. 2 juta itu juga masih bisa kali buat beli barang baru kulkas 1 pintu dan smartphone low end",
    "Komentar_Bersih": "anjay orkay nih juta kali beli barang kulkas pintu smartphone low end",
    "sentiment": "netral"
  },
  {
    "Username": "verzac05",
    "Komentar": "Udah dinaikin ke 10 juta IIRC, waktu mau belanja di iBox juga udh dibilang mba-mbanya kalo QRIS bisa-nya 10 juta\n\nhttps://www.jaringanprima.co.id/id/limit-transaksi-qris-naik-jadi-rp-10-juta#:~:text=Dalam%20Rapat%20Dewan%20Gubernur%20(RDG,berlaku%20sejak%201%20Maret%202022.",
    "Komentar_Bersih": "udah dinaikin juta iirc belanja ibox udh bilang mbambanya kalo qris bisa juta",
    "sentiment": "netral"
  },
  {
    "Username": "YukkuriOniisan",
    "Komentar": "Yup. Bough a Samsung 511 Liter fridge. No need to withdraw large amount of money from ATM anymore.\n\nThe scary part is that since the money is intangible, the sense of 'loss' is very much reduced. Luckily I am not that 'consumerist'. But I can see how this cashless could make someone spend more money than what they usually do.",
    "Komentar_Bersih": "yup bough a samsung liter fridge no need to withdraw large amount of money from atm anymore the scary part is that since the money is intangible the sense of loss is very much reduced luckily i am not that consumerist but i can see how this cashless could make someone spend more money than what they usually do",
    "sentiment": "netral"
  },
  {
    "Username": "plentongreddit",
    "Komentar": "bca one-click is one of the best feature.",
    "Komentar_Bersih": "bca oneclick is one of the best feature",
    "sentiment": "positif"
  },
  {
    "Username": "auditorbersempak",
    "Komentar": "do you know QRIS vendor that dont accept other payment other than theirs?",
    "Komentar_Bersih": "do you know qris vendor that dont accept other payment other than theirs",
    "sentiment": "netral"
  },
  {
    "Username": "ArchTemperedKoala",
    "Komentar": "Or the one thing making indomaret fail.. Where I'm at there's usually an alfamart or circle k nearby and I just go there instead..",
    "Komentar_Bersih": "or the one thing making indomaret fail where im at theres usually an alfamart or circle k nearby and i just go there instead",
    "sentiment": "negatif"
  },
  {
    "Username": "ArchTemperedKoala",
    "Komentar": "Or the one thing making indomaret fail.. Where I'm at there's usually an alfamart or circle k nearby and I just go there instead..",
    "Komentar_Bersih": "or the one thing making indomaret fail where im at theres usually an alfamart or circle k nearby and i just go there instead",
    "sentiment": "negatif"
  },
  {
    "Username": "thatesa",
    "Komentar": "isaku more like isampah. Noone uses it.",
    "Komentar_Bersih": "isa more like isampah noone uses it",
    "sentiment": "positif"
  },
  {
    "Username": "IdleAsianGuy",
    "Komentar": "mereka pengen ada uang yg ngendap di isaku",
    "Komentar_Bersih": "ken uang yg ngendap isa",
    "sentiment": "netral"
  },
  {
    "Username": "knightingale2k1",
    "Komentar": "percuma isaku krn cuma bisa buat indomaret aja kalo setau gw. qris lebih umum, krn bisa dipakai di macam2 bank",
    "Komentar_Bersih": "isa krn indomaret aja kalo tau gw qris krn pakai bank",
    "sentiment": "netral"
  },
  {
    "Username": "BenL90",
    "Komentar": "Sistem POS mereka lucu sama ERP nya. Dulu pernah dep dep An masukin proyek ERP. Their system arch is quite bad that the tenders exclude them in the whole group (big group), and just allow us pass through.. 😂",
    "Komentar_Bersih": "sistem pos lucu erp nya dep dep an masukin proyek erp their system arch is quite bad that the tenders exclude them in the whole group big group and just allow us pass through",
    "sentiment": "negatif"
  },
  {
    "Username": "ezkailez",
    "Komentar": "Tapi implementasi pembayaran gopay bisa ._.",
    "Komentar_Bersih": "implementasi bayar gopay",
    "sentiment": "netral"
  },
  {
    "Username": "supirman",
    "Komentar": "Cara kerjanya gimana tuh, QRIS nya per toko atau per transaksi?",
    "Komentar_Bersih": "kerja gimana tuh qris nya toko transaksi",
    "sentiment": "netral"
  },
  {
    "Username": "Royal_Front2038",
    "Komentar": "Kalau sebesar indomaret kek nya bisa nego fee transaksi.",
    "Komentar_Bersih": "indomaret kek nya nego fee transaksi",
    "sentiment": "netral"
  },
  {
    "Username": "ezkailez",
    "Komentar": "Gopay ≠ QRIS. Gw coba tanya \"bisa pake qr bca ga\" and the answer is no.\n\nPadahal seinget gw kalo pake debit bca bisa tanpa minimum",
    "Komentar_Bersih": "gopay qris gw coba pake qr bca ga and the answer is no seinget gw kalo pake debit bca minimum",
    "sentiment": "netral"
  },
  {
    "Username": "Raestloz",
    "Komentar": "Dari dulu itu. Nyokap gua belanja maceman wortel 9rb dibilang tanggung tambah apa deh jadi 10rb pas",
    "Komentar_Bersih": "nyokap gua belanja maceman wortel rb bilang tanggung deh rb pas",
    "sentiment": "netral"
  },
  {
    "Username": "kampr3t0",
    "Komentar": "gw kaget kemarin pas puasa ternyata tukang risol langganan udah bisa bayar pakai QRIS",
    "Komentar_Bersih": "gw kaget kemarin pas puasa tukang risol langgan udah bayar pakai qris",
    "sentiment": "netral"
  },
  {
    "Username": "flag9801",
    "Komentar": "even pengamen and pengemis embrace modernity",
    "Komentar_Bersih": "even amen and emis embrace modernity",
    "sentiment": "netral"
  },
  {
    "Username": "IvanderGGKEK",
    "Komentar": "Kalo hp gw yg di scan (misalnya bayar di Alfamart make gopay) aman2 aja, scanny cepet, tapi kalo camera gw hrus ngescan QRIS di kertas (apalagi layar yang kadang ad silau2 gtu) itu mah ga scan2, ga tau napa\n\nTapi biasanya cuma di gopay ama ovo sih, gw scan QRIS mandiri gw aman2 aja gatau napa",
    "Komentar_Bersih": "kalo hp gw yg scan bayar alfamart make gopay aman aja scanny cepet kalo camera gw hrus ngescan qris kertas layar kadang ad silau gtu mah ga scan ga tau napa gopay ama ovo sih gw scan qris mandiri gw aman aja gatau napa",
    "sentiment": "positif"
  },
  {
    "Username": "shitihs",
    "Komentar": "QRIS ini maksudnya yang scan, bukan yang ditampilin di layar HP kan? Di alfa sekarang pake code yang pake kode QR deh (udah ga pake barcode). \n\nGatau bedanya apa sih, karena sempet ada kasir yang ga paham, dibilangnya pake yang barcode tapi pas gw kasih barcode udah gak bisa. Oh ya ini kalo pake gopay, gatau kalo OVO.",
    "Komentar_Bersih": "qris maksud scan ditampilin layar hp alfa pake code pake kode qr deh udah ga pake barcode gatau beda sih sempet kasir ga paham bilang pake barcode pas gw kasih barcode udah gak oh ya kalo pake gopay gatau kalo ovo",
    "sentiment": "netral"
  },
  {
    "Username": "garuktete",
    "Komentar": "Idk but this looks like from the HIV aladeen scene",
    "Komentar_Bersih": "idk but this looks like from the hiv aladeen scene",
    "sentiment": "positif"
  },
  {
    "Username": "Specsaman",
    "Komentar": "No you’re wrong\n\nQRIS",
    "Komentar_Bersih": "no youre wrong qris",
    "sentiment": "netral"
  },
  {
    "Username": "tnth89",
    "Komentar": "Dan ada biaya 3 ribu buat settlement kan?\n\nDan masuk duitnya 1-3 hari tergantung bank",
    "Komentar_Bersih": "biaya ribu settlement masuk duit gantung bank",
    "sentiment": "netral"
  },
  {
    "Username": "ezkailez",
    "Komentar": "BRI ga bisa untuk co-branding. Gw pny tokped bri ga bisa",
    "Komentar_Bersih": "bri ga cobranding gw pny tokped bri ga",
    "sentiment": "netral"
  },
  {
    "Username": "andyytan",
    "Komentar": "Um, actually same for me. I used QRIS at some fancy ice cream place last month and they said the payment didn't go through, was told to pay again even though it's recorded in my bank's statement. I argued with the manager for quite some time that's on the bank and not me, and was finally let go with agreements and whatnot.\n\nSafe to say I won't be using QRIS for any substantial transaction lol.",
    "Komentar_Bersih": "um actually same for me i used qris at some fancy ice cream place last month and they said the payment didnt go through was told to pay again even though its recorded in my banks statement i argued with the manager for quite some time thats on the bank and not me and was finally let go with agreements and whatnot safe to say i wont be using qris for any substantial transaction lol",
    "sentiment": "positif"
  },
  {
    "Username": "turkslime",
    "Komentar": "Sharing aja sih, tahun kemarin gua sempet transaksi laptop 5 juta+ aman kok via QRIS",
    "Komentar_Bersih": "sharing aja sih kemarin gua sempet transaksi laptop juta aman via qris",
    "sentiment": "positif"
  },
  {
    "Username": "michaelliem99",
    "Komentar": "Bayar pake QRIS di octo mobile pake CC untuk >500k, terus ubah ke cicilan 3 bulan bunga 0% dan free admin.\n\nBehhh, lumayan bgt buat transaksi gede yg sampe jutaan tapi ga bisa bayar pake CC langsung.",
    "Komentar_Bersih": "bayar pake qris octo mobile pake cc k ubah cicil bunga free admin behhh lumayan bgt transaksi gede yg sampe juta ga bayar pake cc langsung",
    "sentiment": "netral"
  },
  {
    "Username": "Jkt4N",
    "Komentar": "Soal NFC itu, kebanyakan si market dependent mislanya samsung, tapi kebanyakan brand china gak pake karena china pembayaran mostly QR\n\npadahal sebenernya NFC itu lebih cepet dan gampang, tinggal beneran tap aja gk usah pencet ato buka app \n\ngw masih nunggu ada bank yang mau collab buat apple pay ato google pay\n\nOr at least ffs give me the option to connect my credit card to QRIS then I’ll shut up",
    "Komentar_Bersih": "nfc banyak si market dependent mislanya samsung banyak brand china gak pake china bayar mostly qr sebenernya nfc cepet gampang tinggal beneran tap aja gk pencet ato buka app gw nunggu bank collab apple pay ato google pay or at least ffs give me the option to connect my credit card to qris then ill shut up",
    "sentiment": "netral"
  },
  {
    "Username": "lebaran",
    "Komentar": "Mesin-mesin EDC juga sudah bisa QRIS juga selain menerima pembayaran dengan kartu berbasis NFC dan kartu berbasis chip. Setidaknya untuk EDC dari 2 bank besar Mandiri dan BCA.",
    "Komentar_Bersih": "mesinmesin edc qris terima bayar kartu bas nfc kartu bas chip edc bank mandiri bca",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "Me too. Unfortunately, ga semua orang mampu/mau beli mesin EFTPOS yang bisa ngambil NFC payments. QRIS kan mudah dan murah, tinggal scan barcode doang di kertas.",
    "Komentar_Bersih": "me too unfortunately ga orang mampumau beli mesin eftpos ngambil nfc payments qris mudah murah tinggal scan barcode doang kertas",
    "sentiment": "positif"
  },
  {
    "Username": "ranyi",
    "Komentar": "ohh, malay also use the term \"duit\"? but i thought it came from the dutch",
    "Komentar_Bersih": "ohh malay also use the term duit but i thought it came from the dutch",
    "sentiment": "netral"
  },
  {
    "Username": "qornanali",
    "Komentar": "Thanks.",
    "Komentar_Bersih": "thanks",
    "sentiment": "netral"
  },
  {
    "Username": "Kosaki_MacTavish",
    "Komentar": "Kalau TemanBis kan nggak bisa cash karena nggak ada halte yang ada penjaganya, antara harus pakai aplikasinya TJ atau QRIS. Naik TJ biasa bisa bayar cash sama penjaganya.",
    "Komentar_Bersih": "temanbis nggak cash nggak halte jaga pakai aplikasi tj qris tj bayar cash jaga",
    "sentiment": "netral"
  },
  {
    "Username": "rulakhy",
    "Komentar": "Itu namanya 70% bukan 0.7%",
    "Komentar_Bersih": "nama",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Flair checks out",
    "Komentar_Bersih": "flair checks out",
    "sentiment": "netral"
  },
  {
    "Username": "defmaniac",
    "Komentar": "Yang bener 100.000 dikali 0.007 dong gan, jadi sekitar 700 aja\n\nKalau 30rb sih 70% bukan 0.7%",
    "Komentar_Bersih": "bener kali gan aja rb sih",
    "sentiment": "netral"
  },
  {
    "Username": "Rhypnic",
    "Komentar": "Hah?",
    "Komentar_Bersih": "hah",
    "sentiment": "netral"
  },
  {
    "Username": "TelecomVsOTT",
    "Komentar": "Pas kelas matematika disekolah dulu, tidur ya?",
    "Komentar_Bersih": "pas kelas matematika seko tidur ya",
    "sentiment": "netral"
  },
  {
    "Username": "artie_rd",
    "Komentar": "Not trying to imply it should be free. Besides MDR, They also deduct settlement fee at fixed rate 3.000 for any transaction above 50.000 (2.000 if below). That should be considered since they're targetting UMKM where most of them can be stingy. It's a bit worse if the merchant doesnt own BRI, mandiri, or BCA account, adding 2.900 to the deduction.\n\nIf they're targetting large business owners, then the costs are marginal. But don't expect small businesses to react the same way. I was hoping they could come up solution for the less fortunate ones.\n\nEdit:\nSome business owners usually overcome this issue by creating barcode from their respective EDC Provider (BCA, Mandiri, BRI, etc). I can verify mcdonald do this way to waive the fee.",
    "Komentar_Bersih": "not trying to imply it should be free besides mdr they also deduct settlement fee at fixed rate for any transaction above if below that should be considered since theyre targetting umkm where most of them can be stingy its a bit worse if the merchant doesnt own bri mandiri or bca account adding to the deduction if theyre targetting large business owners then the costs are marginal but dont expect small businesses to react the same way i was hoping they could come up solution for the less fortunate ones edit some business owners usually overcome this issue by creating barcode from their respective edc provider bca mandiri bri etc i can verify mcdonald do this way to waive the fee",
    "sentiment": "negatif"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "yes i hate when some places dont accept cash... so fucking douche",
    "Komentar_Bersih": "yes i hate when some places dont accept cash so fucking douche",
    "sentiment": "negatif"
  },
  {
    "Username": "Reverse_Necromancer",
    "Komentar": "Cash\n1. Buka dompet\n2. Cari uang plus hitung hitung uang yang mendekati\n2.b. ga ada uang kecil atau pas, pinjam temen\n2.c. penjual tidak ada kembalian, keliling area cari kembalian\n3. Penjual hitung kembalian\n4. Terima kembalian\n5. Buka dompet\n6. Masukin uang ke dompet",
    "Komentar_Bersih": "cash buka dompet cari uang plus hitung hitung uang dekat b ga uang pas pinjam temen c jual kembali keliling area cari kembali jual hitung kembali terima kembali buka dompet masukin uang dompet",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "I can't imagine warung sembako or warmindo except credit card, like WOAH\n\nNot gonna mock his/her comment i get his position, but gonna be mindblowon if mie ayam cart in my village has EDC, gonna be my conversation topic for the next month",
    "Komentar_Bersih": "i cant imagine warung sembako or warmindo except credit card like woah not gonna mock hisher comment i get his position but gonna be mindblowon if mie ayam cart in my village has edc gonna be my conversation topic for the next month",
    "sentiment": "positif"
  },
  {
    "Username": "Rhypnic",
    "Komentar": "Sebenarnya yang super apps itu developernya kalau paham pake fitur lazy loading jadi kalau ga dipencet ya ga ngaruh loading appsmu.\n\nDan appnya arsitektur yang microservice atau fitur kecil yg dipecah bahasa awamnya ga kayak monolithic atau 1 app gede full loadingnya lama.\n\nBeberapa developer juga pake PWA yang artinya applikasi itu sebenarnya web dibungkus app jadi ga perlu update tiba tiba fiturnya berubah sendiri.\nKeuntungan pwa ini user ga perlu load apps asset atau code bejibun cuma butuh akses internet sama cache untuk nyimpan gambar dan info lain lain. Contoh sih gojek tapi dia hybrid PWA sama native",
    "Komentar_Bersih": "super apps developer paham pake fitur lazy loading ga pencet ya ga ngaruh loading appsmu appnya arsitektur microservice fitur yg pecah bahasa awam ga kayak monolithic app gede full loadingnya developer pake pwa applikasi web bungkus app ga update fiturnya ubah untung pwa user ga load apps asset code bejibun butuh akses internet cache nyimpan gambar info contoh sih gojek hybrid pwa native",
    "sentiment": "netral"
  },
  {
    "Username": "Whatever14x",
    "Komentar": "Upgrade device lol",
    "Komentar_Bersih": "upgrade device lol",
    "sentiment": "netral"
  },
  {
    "Username": "plentongreddit",
    "Komentar": "So far, happy sama aplikasi bca sih, ndak pernah lemot kecuali nunggu tanda ijo yg kadang2 agak lama kalau sinyal jelek.",
    "Komentar_Bersih": "so far happy aplikasi bca sih ndak lot kecuali nunggu tanda ijo yg kadang sinyal jelek",
    "sentiment": "negatif"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "I guess this joke doesn't applied for Blu user",
    "Komentar_Bersih": "i guess this joke doesnt applied for blu user",
    "sentiment": "netral"
  },
  {
    "Username": "elengels",
    "Komentar": "pindahlah ke mybca mulai detik ini\n\neh jgn dulu deh, pelan2 aja pindahnya",
    "Komentar_Bersih": "pindah mybca detik eh jgn deh pelan aja pindah",
    "sentiment": "netral"
  },
  {
    "Username": "rulakhy",
    "Komentar": "Jadi kangen nunggu lampu indikator ijo sejak pindah myBCA.\n\nPindah ke myBCA alasan utamanya waktu itu karena bukti transfernya lebih cakep dan bisa langsung simpan gallery, ga repot screenshot & crop buat ngirim ke orang",
    "Komentar_Bersih": "kangen nunggu lampu indikator ijo pindah mybca pindah mybca alas utama bukti transfer cakep langsung simpan gallery ga repot screenshot crop ngirim orang",
    "sentiment": "netral"
  },
  {
    "Username": "eckyp",
    "Komentar": "Haha ya untunglah kalo gw makenya bener. HP gw Udah cukup berumur, jadi lemot, mungkin nambah k clunky-an nya.",
    "Komentar_Bersih": "haha ya untung kalo gw makenya bener hp gw udah umur lot nambah k clunkyan nya",
    "sentiment": "netral"
  },
  {
    "Username": "yatay99",
    "Komentar": "Why are you getting downvoted?\n\nStep 2 kartu itu emang LAMA. Super LAMA. 80% kasir bakal kebingungan ngoperasiinnya, manggil temen dulu lah, milih perangkat yang sesuai, nginput harganya lemot, kadang2 gak detect, kadang2 harus input 2x dan ini yang bikin waswas.",
    "Komentar_Bersih": "why are you getting downvoted step kartu emang super kasir bingung ngoperasiinnya manggil temen milih perangkat sesuai nginput harga lot kadang gak detect kadang input x bikin waswas",
    "sentiment": "netral"
  },
  {
    "Username": "Bermainangin",
    "Komentar": "Eh typo bang mangsud ane 1rb",
    "Komentar_Bersih": "eh typo bang mangsud ane rb",
    "sentiment": "netral"
  },
  {
    "Username": "Veynareth",
    "Komentar": "mungkin SaltBae udah buka warung di indo.",
    "Komentar_Bersih": "saltbae udah buka warung indo",
    "sentiment": "netral"
  },
  {
    "Username": "andyytan",
    "Komentar": "Yup. QRIS dependency internetnya dobel di merchant + user yang scan, kalau swipe/tap cuma 1 si merchant. Honestly gw ga sabar penetrasi contactless nyebar di Indonesia, minimal merchant2 gede yang emang udah punya edc lah.",
    "Komentar_Bersih": "yup qris dependency internetnya dobel merchant user scan swipetap si merchant honestly gw ga sabar penetrasi contactless nyebar indonesia minimal merchant gede emang udah edc",
    "sentiment": "netral"
  },
  {
    "Username": "GalaksiAndromeda",
    "Komentar": "accessibility. Gmn dgn penyandang disabilitas / orang tua yg gaptek / org ga punya hp / dsb?",
    "Komentar_Bersih": "accessibility gmn dgn sandang disabilitas orang tua yg gaptek org ga hp dsb",
    "sentiment": "netral"
  },
  {
    "Username": "SimultaneousPing",
    "Komentar": "meanwhile kantin sekolah gua yang udah menerima QRIS, dana, gopay, sama ovo 🗿",
    "Komentar_Bersih": "meanwhile kantin sekolah gua udah terima qris dana gopay ovo",
    "sentiment": "netral"
  },
  {
    "Username": "stormatombd",
    "Komentar": "Gwe ke indomart gak bisa pake dana, mereka maunya app apalahbitu lupabgwe banyak bener aplikaishya",
    "Komentar_Bersih": "gwe indomart gak pake dana mau app apalahbitu lupabgwe bener aplikaishya",
    "sentiment": "netral"
  },
  {
    "Username": "Phonixrmf",
    "Komentar": "r/unexpectedmrrobot (kinda)",
    "Komentar_Bersih": "runexpectedmrrobot kinda",
    "sentiment": "netral"
  },
  {
    "Username": "Mlrk3y",
    "Komentar": "No one preaches QRIS on Reddit as much as you :)",
    "Komentar_Bersih": "no one preaches qris on reddit as much as you",
    "sentiment": "netral"
  },
  {
    "Username": "visual-vomit",
    "Komentar": "1. Konsistensi bahasa Q key indo, R are english, I Eeee indo, S... S.\n2. 4 syllables dibanding 1-2",
    "Komentar_Bersih": "konsistensi bahasa q key indo r are english i eeee indo s s syllables banding",
    "sentiment": "netral"
  },
  {
    "Username": "jelleque",
    "Komentar": "Di beberapa daerah manggilnya emang tampal ban. Di sumsel (ga tau di seluruh sumsel ato cuma area tempat aku) juga manggilnya tampal ban",
    "Komentar_Bersih": "daerah manggilnya emang tampal ban sumsel ga tau sumsel ato area manggilnya tampal ban",
    "sentiment": "netral"
  },
  {
    "Username": "cobapedas",
    "Komentar": "Did i stutter?",
    "Komentar_Bersih": "did i stutter",
    "sentiment": "netral"
  },
  {
    "Username": "Lev22_",
    "Komentar": "Tambal Pan",
    "Komentar_Bersih": "tambal pan",
    "sentiment": "netral"
  },
  {
    "Username": "slavengineer",
    "Komentar": "Second this, Shell bisa ngetap kartu kredit NFC tanpa pake planga plongo kasirnya. Tinggal nyodorin kartu sambil bilang \"Langsung tap aja ya Mas/ Mba bayarnya\" 👍",
    "Komentar_Bersih": "second this shell ngetap kartu kredit nfc pake planga plongo kasir tinggal nyodorin kartu bilang langsung tap aja ya mas mba bayar",
    "sentiment": "netral"
  },
  {
    "Username": "INDO_GAMER2XN",
    "Komentar": "kemudian terjadilah banyak insiden kebakaran di spbu gara-gara maen hp waktu pengisian bahan bakar...",
    "Komentar_Bersih": "insiden bakar spbu garagara maen hp isi bahan bakar",
    "sentiment": "netral"
  },
  {
    "Username": "urboy008",
    "Komentar": "Kalau isi bensin motor pake mypertamina convenient gak? Kalau iya gua mulai pake itu besok",
    "Komentar_Bersih": "isi bensin motor pake mypertamina convenient gak iya gua pake besok",
    "sentiment": "positif"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "atm aja ga perlu kartu sekarang, cuman perlu bawa hape",
    "Komentar_Bersih": "atm aja ga kartu cuman bawa hape",
    "sentiment": "netral"
  },
  {
    "Username": "izfanx",
    "Komentar": "Tapi orangnya beli kulkas Samsung 511 liter yg harganya lebih dari 2 jt. Gmn tuh?",
    "Komentar_Bersih": "orang beli kulkas samsung liter yg harga jt gmn tuh",
    "sentiment": "netral"
  },
  {
    "Username": "ezkailez",
    "Komentar": "Taking notes of every transaction helps a lot for me. Jadi tetep berasa wkwkw",
    "Komentar_Bersih": "taking notes of every transaction helps a lot for me tetep asa wkwkw",
    "sentiment": "netral"
  },
  {
    "Username": "turkslime",
    "Komentar": "Yep, seperti kata Tara arts circa 2015an, pakai cashless itu bahaya buat khilafnya meroket 1000% 😂\n\nDia emang peramal handal",
    "Komentar_Bersih": "yep tara arts circa an pakai cashless bahaya khilaf roket emang amal handal",
    "sentiment": "netral"
  },
  {
    "Username": "arytapermana",
    "Komentar": "sebenernya hampir semua bank dan digital payment di support tapi kadang kalau pas belanja dan mbak nya \"QRIS apa kak?\" \"maaf qris  itu tidak bisa disini tapi bank x bisa\"\n\nWhat's wrong? didn't QRIS supposedly accept multi-payment system?",
    "Komentar_Bersih": "sebenernya bank digital payment support kadang pas belanja mbak nya qris kak maaf qris bank x whats wrong didnt qris supposedly accept multipayment system",
    "sentiment": "positif"
  },
  {
    "Username": "notafunnyguy32",
    "Komentar": "Indomaret is too strong of a brand to fail from just that imo, and they still have time. A good amount of Indonesians still use cash",
    "Komentar_Bersih": "indomaret is too strong of a brand to fail from just that imo and they still have time a good amount of indonesians still use cash",
    "sentiment": "netral"
  },
  {
    "Username": "pradipta09",
    "Komentar": "Family mart aja bisa pake qris, Indomaret malah gabisa",
    "Komentar_Bersih": "family mart aja pake qris indomaret gabisa",
    "sentiment": "netral"
  },
  {
    "Username": "flag9801",
    "Komentar": "alfathingy have e-receipt and that shit is most usefull for me cause i will know what shit i buy in alfaper month basis",
    "Komentar_Bersih": "alfathingy have ereceipt and that shit is most usefull for me cause i will know what shit i buy in alfaper month basis",
    "sentiment": "netral"
  },
  {
    "Username": "flag9801",
    "Komentar": "bocil mau topup seem to use it\n\ni mean it is the only way if they don't know jackshit about topup using other app",
    "Komentar_Bersih": "bocil topup seem to use it i mean it is the only way if they dont know jackshit about topup using other app",
    "sentiment": "netral"
  },
  {
    "Username": "Hntrz63",
    "Komentar": "pertransaksi",
    "Komentar_Bersih": "transaksi",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Kalo pake QRIS, ga bisa. Sudah fix dari BI. That's why pake token",
    "Komentar_Bersih": "kalo pake qris ga fix bi thats why pake token",
    "sentiment": "netral"
  },
  {
    "Username": "New-bees",
    "Komentar": "Dan sebentar lagi pengemis, pengamen bisa pake Qris wkwwk",
    "Komentar_Bersih": "sebentar emis amen pake qris wkwwk",
    "sentiment": "netral"
  },
  {
    "Username": "IdleAsianGuy",
    "Komentar": "coba scannya posisi miring, jangan horizontal (kena pantulan lampu ruangan)",
    "Komentar_Bersih": "coba scannya posisi miring horizontal kena pantul lampu ruang",
    "sentiment": "netral"
  },
  {
    "Username": "Augussst4",
    "Komentar": "Coba difoto dulu baru discan lewat galery, gw biasanya juga gitu",
    "Komentar_Bersih": "coba foto discan galery gw gitu",
    "sentiment": "netral"
  },
  {
    "Username": "IndependenceEmpty821",
    "Komentar": "shopeeepay juga sering susah scan wkwk",
    "Komentar_Bersih": "shopeeepay susah scan wkwk",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "Qris itu ada dua duanya. Yang discan itu namanya Merchant Presented Mode. Dan Kalo yang kita kasih itu namanya Costumer Presented Mode.\n\nKalo lu scan Barcode QRIS, itu ada identifier bank pembuat QRIS, nama toko, identifier, dsb.\n\nKalo cuma kayak isaku 1 000 000 000, itu token key. Atau Kalo pun bentuknya QR, kalo lu scan, itu encrypted string Dan unreadable Sama sekali.",
    "Komentar_Bersih": "qris dua discan nama merchant presented mode kalo kasih nama costumer presented mode kalo lu scan barcode qris identifier bank buat qris nama toko identifier dsb kalo kayak isa token key kalo bentuk qr kalo lu scan encrypted string unreadable",
    "sentiment": "netral"
  },
  {
    "Username": "Phonixrmf",
    "Komentar": ":)\n\n:(\n\n:)",
    "Komentar_Bersih": "",
    "sentiment": "netral"
  },
  {
    "Username": "Phonixrmf",
    "Komentar": "get real! it's QRIS, it's always been QRIS",
    "Komentar_Bersih": "get real its qris its always been qris",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Idk about that bro, ku ke warmindo bayar pake QRIS kasirnya langsung cek hape \"oh dah masuk mas\", then proceed the receipt",
    "Komentar_Bersih": "idk about that bro ku warmindo bayar pake qris kasir langsung cek hape oh dah masuk mas then proceed the receipt",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "GA ADA.\n\nsekali lagi, dari BI, GA ADA aturannya pake settlement. \n\nYang pake settlement itu QRIS kalo lu bikin sama TELKOM atau entity non bank (midtrans, dkk.). Kalo lu buka rekening bisnis bank dan minta QRIS, ga ada biaya settlement.",
    "Komentar_Bersih": "ga bi ga atur pake settlement pake settlement qris kalo lu bikin telkom entity non bank midtrans dkk kalo lu buka rekening bisnis bank qris ga biaya settlement",
    "sentiment": "netral"
  },
  {
    "Username": "ontorion",
    "Komentar": "Setau gua ga ada, temen gua bikin QRIS di [qris.id](https://qris.id) buat kebutuhan dagangnnya ga ada biaya settlement, tapi settlementnya tiap 2 hari sekali katanya, ditarik ke rekening BCA free, ga ada biaya.\n\nMDR juga masih free sampe pertengahan tahun ini.",
    "Komentar_Bersih": "tau gua ga temen gua bikin qris qrisid butuh dagangnnya ga biaya settlement settlementnya tarik rekening bca free ga biaya mdr free sampe tengah",
    "sentiment": "netral"
  },
  {
    "Username": "alvinvin00",
    "Komentar": "kudu install BRImo dan punya rekening mereka dulu kekny",
    "Komentar_Bersih": "kudu install brimo rekening kekny",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "I don't use credit card for QRIS, my virtual debit card only used for GCP lololol\n\nI use Blu(BCA Digital) tho, so it's a QRIS goodness and BCA ATM goodness in my hand\n\nDebit Card side is kinda suck ass, still need Jago for that\n\nI'm too idiot and scared for using credit card, my idiot brain gonna max out the heck out of it then debt, hehe\n\nIdk if you can connect gopay with CC, need to look at that",
    "Komentar_Bersih": "i dont use credit card for qris my virtual debit card only used for gcp lololol i use blubca digital tho so its a qris goodness and bca atm goodness in my hand debit card side is kinda suck ass still need jago for that im too idiot and scared for using credit card my idiot brain gonna max out the heck out of it then debt hehe idk if you can connect gopay with cc need to look at that",
    "sentiment": "netral"
  },
  {
    "Username": "besoksaja",
    "Komentar": "Kartu kredit CIMB Niaga sudah ada yang bisa pakai QRIS. Aku bayar makan di warung juga pakai QRIS, sumber dana pakai kartu kredit. Jadi di tagihan kartu kredit banyak transaksi kecil-kecil. Kartu kredit Citibank juga sudah ada, tinggal diaktifkan di citibank mobile, tapi ini aku belum pernah coba.",
    "Komentar_Bersih": "kartu kredit cimb niaga pakai qris bayar makan warung pakai qris sumber dana pakai kartu kredit tagih kartu kredit transaksi kecilkecil kartu kredit citibank tinggal aktif citibank mobile coba",
    "sentiment": "netral"
  },
  {
    "Username": "diedrop",
    "Komentar": ">padahal sebenernya NFC itu lebih cepet dan gampang, tinggal beneran tap aja gk usah pencet ato buka app \n\nSetuju kalo buat bayar krl, tol, bis dkk, tapi kalo belanja gw lebih suka qris, liat jumlah uangnya + mencet tombol confirm itu ngasih sedikit kontrol bagi gw.",
    "Komentar_Bersih": "sebenernya nfc cepet gampang tinggal beneran tap aja gk pencet ato buka app tuju kalo bayar krl tol bis dkk kalo belanja gw suka qris liat uang mencet tombol confirm ngasih kontrol gw",
    "sentiment": "positif"
  },
  {
    "Username": "LicheXam",
    "Komentar": "Dana?",
    "Komentar_Bersih": "dana",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Yep I'm aware of this, use it at the cafe and zoo",
    "Komentar_Bersih": "yep im aware of this use it at the cafe and zoo",
    "sentiment": "netral"
  },
  {
    "Username": "bxbb",
    "Komentar": "cross adoption (atau apalah istilahnya).\n\nmalay adopsi duit dari Hindia Belanda, HB adopsi uang dari Malay.",
    "Komentar_Bersih": "cross adoption apa istilah malay adopsi duit hindia belanda hb adopsi uang malay",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "TemanBis???? DM me bro, explain lmao",
    "Komentar_Bersih": "temanbis dm me bro explain lmao",
    "sentiment": "netral"
  },
  {
    "Username": "beelzebub-rising",
    "Komentar": "Nah, kalau 3000 per settlement fee ini mah ulah dari PJSP (Perusahaan Penyelenggara Jasa Sistem Pembayaran) ny sendiri, bukan regulasi BI. Biaya BI sendiri \"hanya\" maksimal 0.7% (bisa lebih murah tergantung jenis transaksi / jasa) and no more.",
    "Komentar_Bersih": "settlement fee mah ulah pjsp usaha selenggara jasa sistem bayar ny regulasi bi biaya bi maksimal murah gantung jenis transaksi jasa and no more",
    "sentiment": "netral"
  },
  {
    "Username": "ml2000id",
    "Komentar": "Not accepting cash should be illegal. It is the legal tender\n\nEven Gerbang tol minimal harusnya ada satu yang bs terima cash. Apalagi restoran resroran",
    "Komentar_Bersih": "not accepting cash should be illegal it is the legal tender even gerbang tol minimal bs terima cash restoran resroran",
    "sentiment": "netral"
  },
  {
    "Username": "volcia",
    "Komentar": "It is still possible though! Then again UMKM here in ~~Japan~~ Tokyo prefers using ovo/gopay-like payment (paypay) over something like credit-card/passmo/suica. So, I guess qris is really that convenient.",
    "Komentar_Bersih": "it is still possible though then again umkm here in japan tokyo prefers using ovogopaylike payment paypay over something like creditcardpassmosuica so i guess qris is really that convenient",
    "sentiment": "positif"
  },
  {
    "Username": "Much_Oil9487",
    "Komentar": ">\tfitur lazy loading jadi kalau ga dipencet ya ga ngaruh loading appsmu.\n\nKl ky gini biasanya tetep ada service buat dapet list service apa aja yg available kan\n\nTrs request buat list promo, banner, inbox/notification etc\n\nBbrp apps itu ada yg pas pertama buka ada banner promo yg perlu di close dulu yg jelas ngeblock user, ini pernah dr dev minta buat diilangin tp dr tim product n diatasnya ga mau\n\n\n>\tKeuntungan pwa ini user ga perlu load apps asset atau code bejibun cuma butuh akses internet sama cache untuk nyimpan gambar dan info lain lain. \n\nKl inetnya lemot bukannya malah jd lebih lama loading pertamanya? Apa lg kl byk imagenya. Walau udah dicache jg waktu harus invalidate cachenya bakal butuh waktu load assetsnya\n\nDulu kerjaan gw sempet ngeconvert page H5 di apps jadi native biar prosesnya lebih cepet, karena H5 harus request data ke BE + load image dr CDN, sedangkan native perlu request ke BE + kl imagenya static bisa disimpen di app bundle\n\nDi native apps kl mau ubah fitur tanpa update bisa kok pake feature flag, tapi yah harus di develop function feature flagnya sebelum release ntar tinggal diupdate aja value flagnya via service",
    "Komentar_Bersih": "fitur lazy loading ga pencet ya ga ngaruh loading appsmu kl ky gin tetep service dapet list service aja yg available trs request list promo banner inboxnotification etc bbrp apps yg pas buka banner promo yg close yg ngeblock user dr dev diilangin tp dr tim product n atas ga untung pwa user ga load apps asset code bejibun butuh akses internet cache nyimpan gambar info kl inetnya lot jd loading pertama lg kl byk imagenya udah dicache jg invalidate cachenya butuh load assetsnya kerja gw sempet ngeconvert page h apps native biar proses cepet h request data be load image dr cdn native request be kl imagenya static disimpen app bundle native apps kl ubah fitur update pake feature flag yah develop function feature flagnya release ntar tinggal diupdate aja value flagnya via service",
    "sentiment": "netral"
  },
  {
    "Username": "Much_Oil9487",
    "Komentar": "Ga semua prosesnya di device, waktu buka app pertama kali kan pasti ada request ke server, nah makin byk fiturnya request ke server ini bisa makin byk n makin lama tergantung koneksi inet n spec/bandwith servernya sendiri",
    "Komentar_Bersih": "ga proses device buka app kali request server byk fiturnya request server byk n gantung koneksi inet n specbandwith servernya",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "HOLD UP!  \n\n\ntunggu indikator hijau dulu....",
    "Komentar_Bersih": "hold up tunggu indikator hijau",
    "sentiment": "netral"
  },
  {
    "Username": "raumdeuters",
    "Komentar": "Klo pake iphone, tinggal pasang widget qris bca. Diklik langsung buka scan qris.",
    "Komentar_Bersih": "klo pake iphone tinggal pasang widget qris bca klik langsung buka scan qris",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "bedanya apa ya? kadang bingung sama Bca kebanyakan app.",
    "Komentar_Bersih": "beda ya kadang bingung bca banyak app",
    "sentiment": "netral"
  },
  {
    "Username": "flag9801",
    "Komentar": "is it 1/8 old or 2/16 old or below both of these",
    "Komentar_Bersih": "is it old or old or below both of these",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "kasian mas, bocuan tu warung, misalnya kena settlement fee 1000-2000, malah minus?",
    "Komentar_Bersih": "kasi mas bocuan tu warung kena settlement fee minus",
    "sentiment": "netral"
  },
  {
    "Username": "Affectionate-Quit664",
    "Komentar": "Ya tinggal bayar cash?",
    "Komentar_Bersih": "ya tinggal bayar cash",
    "sentiment": "netral"
  },
  {
    "Username": "Loading_Internet",
    "Komentar": "Sama 🗿, tapi masih ada beberapa yg pakai cash",
    "Komentar_Bersih": "yg pakai cash",
    "sentiment": "netral"
  },
  {
    "Username": "kelingking_kucing",
    "Komentar": "yg manggil tempel ban juga ada di sumatera",
    "Komentar_Bersih": "yg manggil tempel ban sumatera",
    "sentiment": "netral"
  },
  {
    "Username": "pradipta09",
    "Komentar": "Heran gue, emg ribet ya ngelatih kasir buat tau cara bayar pake kartu yg support nfc?",
    "Komentar_Bersih": "heran gue emg ribet ya ngelatih kasir tau bayar pake kartu yg support nfc",
    "sentiment": "netral"
  },
  {
    "Username": "ontorion",
    "Komentar": "Ga gitu, dilarang main handphone karena gelombang dari handphone bisa ngacauin akurasi dari takaran mesin pompanya. \n\nGa ada hubungannya maen HP terus meledak di pom bensin.",
    "Komentar_Bersih": "ga gitu larang main handphone gelombang handphone ngacauin akurasi takar mesin pompa ga hubung maen hp ledak pom bensin",
    "sentiment": "netral"
  },
  {
    "Username": "turkslime",
    "Komentar": "Yep, ATM gua hilang dari 2021 dan udah manfaatin tarik tunai non-kartu sejak saat itu. Bahkan sekarang udah support setor tunai juga.\n\nSayang, pilihan nominal minimalnya 100k, berharap bisa 50k and it's all heaven",
    "Komentar_Bersih": "yep atm gua hilang udah manfaatin tarik tunai nonkartu udah support setor tunai sayang pilih nominal minimal k harap k and its all heaven",
    "sentiment": "positif"
  },
  {
    "Username": "STRAVDIUS",
    "Komentar": "SShhhh!!!  don't blow the marketing cover dude",
    "Komentar_Bersih": "sshhhh dont blow the marketing cover dude",
    "sentiment": "netral"
  },
  {
    "Username": "turkslime",
    "Komentar": "Coba pake app di play store/app store bang. Lebih efisien, kadang ada fitur outlook buat anggaran kita 6 bulan ke depan juga",
    "Komentar_Bersih": "coba pake app play storeapp store bang efisien kadang fitur outlook anggar",
    "sentiment": "netral"
  },
  {
    "Username": "Rooster_Hunter0705",
    "Komentar": "seringnya malah cuma nerima OVO dan Go-pay",
    "Komentar_Bersih": "nerima ovo gopay",
    "sentiment": "netral"
  },
  {
    "Username": "auditorbersempak",
    "Komentar": "ohh yeah I encounter that too. probably the cause is like what u/gatelgatelbentol explained in comment above",
    "Komentar_Bersih": "ohh yeah i encounter that too probably the cause is like what ugatelgatelbentol explained in comment above",
    "sentiment": "positif"
  },
  {
    "Username": "ArchTemperedKoala",
    "Komentar": "True. One other reason I avoid indomaret is they no longer have promag and bodrex in store around here, meanwhile the others sell them just fine.\n\nI'm an addict lol",
    "Komentar_Bersih": "true one other reason i avoid indomaret is they no longer have promag and bodrex in store around here meanwhile the others sell them just fine im an addict lol",
    "sentiment": "netral"
  },
  {
    "Username": "ezkailez",
    "Komentar": "I hate that the closest convenience store near me is indomaret. Perlu jalan lebih jauh 5 menit buat ke alfamart. Tapi alfamart ada myroti yg jauh lebih murah (myroti funwari 14rb vs sari roti double soft 19rb)",
    "Komentar_Bersih": "i hate that the closest convenience store near me is indomaret jalan menit alfamart alfamart myroti yg murah myroti funwari rb vs sari roti double soft rb",
    "sentiment": "negatif"
  },
  {
    "Username": "ArchTemperedKoala",
    "Komentar": "Gak ada di sini, adanya domar almar sama ck aja",
    "Komentar_Bersih": "gak domar almar ck aja",
    "sentiment": "netral"
  },
  {
    "Username": "se7enseas",
    "Komentar": "TIL. This lowkey will be a gamechanger for me. How to get their e-receipt? An app or something?",
    "Komentar_Bersih": "til this lowkey will be a gamechanger for me how to get their ereceipt an app or something",
    "sentiment": "netral"
  },
  {
    "Username": "New-bees",
    "Komentar": "Lu pake dark mode bukan?\nKlo iya, coba ganti ke light mode dulu. Biasanya berhasil itu",
    "Komentar_Bersih": "lu pake dark mode klo iya coba ganti light mode hasil",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "harus di settle dl, baru bener2 masuk ke akun dia, kena biaya settlement lg..",
    "Komentar_Bersih": "settle dl bener masuk akun kena biaya settlement lg",
    "sentiment": "netral"
  },
  {
    "Username": "Flyer888",
    "Komentar": "Pas lu scan itu saldonya sebenernya masih gantung, biasanya di akhir hari baru si merchant ini settlement (konsepnya sama kayak withdraw ke rekening bank). Nah tiap settlement ini biasanya ada biaya lagi entah fixed atau persenan.  \n\nNone of these matter to you as the consumer though.",
    "Komentar_Bersih": "pas lu scan saldo sebenernya gantung si merchant settlement konsep kayak withdraw rekening bank settlement biaya fixed persen none of these matter to you as the consumer though",
    "sentiment": "netral"
  },
  {
    "Username": "gatelgatelbentol",
    "Komentar": "QRIS(dot)id itu buatan telkom. Ada biasa settlement. Mungkin skrg masih promo jd ga ada.\n\nBilang ten Lu segera daftar Rekening bisnis ke BCA, BNI atau BRI (yang ini kurang recommended) Dan minta QRIS dari mereka aja. Ga pake settlement kalo dari bank langsung. Modal rekening bisnis rada gede, tapi Mending daripada kena settlement fee wae.",
    "Komentar_Bersih": "qrisdotid buat telkom settlement skrg promo jd ga bilang ten lu daftar rekening bisnis bca bni bri recommended qris aja ga pake settlement kalo bank langsung modal rekening bisnis rada gede mending kena settlement fee wae",
    "sentiment": "positif"
  },
  {
    "Username": "ezkailez",
    "Komentar": "Yes gw punya rekeningnya kok. Tetep aja ga ada di list kartu kredit",
    "Komentar_Bersih": "yes gw rekening tetep aja ga list kartu kredit",
    "sentiment": "netral"
  },
  {
    "Username": "alioth_whyred",
    "Komentar": "Sama, pake blu buat akses BCA & Qris, dan jago buat kartu debit & sync sama gojek.",
    "Komentar_Bersih": "pake blu akses bca qris jago kartu debit sync gojek",
    "sentiment": "netral"
  },
  {
    "Username": "lebaran",
    "Komentar": "QRIS ini gak diimplementasikan di kartu kredit/debit. Tapi implementasinya ada di level aplikasi e-bankingnya untuk bisa menarik dari sumber dana tertentu. Entah itu di link ke kartu kredit, kartu deibt (saldo tabungan), ataupun sumber dana lainnya yang diintegrasikan di dalam aplikasi bank tersebut (misal gopay, dana, atau paylater pun juga bisa) .",
    "Komentar_Bersih": "qris gak implementasi kartu kreditdebit implementasi level aplikasi ebankingnya tarik sumber dana link kartu kredit kartu deibt saldo tabung sumber dana integrasi aplikasi bank gopay dana paylater",
    "sentiment": "netral"
  },
  {
    "Username": "[dihapus]",
    "Komentar": "tol lebih bagus pakai multi lane free flow dibanding NFC, jadi gaperlu berenti dulu",
    "Komentar_Bersih": "tol bagus pakai multi lane free flow banding nfc gaperlu renti",
    "sentiment": "positif"
  },
  {
    "Username": "Jkt4N",
    "Komentar": "[who?](https://youtu.be/GU4Hw-xbBNo)",
    "Komentar_Bersih": "who",
    "sentiment": "netral"
  },
  {
    "Username": "artie_rd",
    "Komentar": "> bisa lebih murah tergantung jenis transaksi\n\nIs it the Regular, Pendidikan, & SPBU one?\n\n\n> kalau 3000 per settlement fee ini mah ulah dsri PJSP\n\n\nTIL, really appreciate the response (not /s)",
    "Komentar_Bersih": "murah gantung jenis transaksi is it the regular didik spbu one settlement fee mah ulah dsri pjsp til really appreciate the response not s",
    "sentiment": "netral"
  },
  {
    "Username": "soemarkoridwan",
    "Komentar": "ya tp justru gahmen yg mulai bgt duluan. sampah",
    "Komentar_Bersih": "ya tp gahmen yg bgt duluan sampah",
    "sentiment": "netral"
  },
  {
    "Username": "Rhypnic",
    "Komentar": "Nah iya gw tau loading pertamanya memang butuh waktu dan imagenya itu again ga langsung di load semua. Biasanya imagenya udah di compress dan baru di load ketika anda scrolling.\n\nJadi ya pinter developernya aja gimana handle resource di waktu yang tepat dan secepat mungkin",
    "Komentar_Bersih": "iya gw tau loading pertama butuh imagenya again ga langsung load imagenya udah compress load scrolling ya pinter developer aja gimana handle resource cepat",
    "sentiment": "positif"
  },
  {
    "Username": "rulakhy",
    "Komentar": "Cuma lebih kekinian aja sih. Mobile BCA yang klasik itu kayaknya dipertahanin buat ngekeep basis nasabah BCA yang konservatif (yang biasanya duitnya lebih banyak) biar ga banyak perubahan.",
    "Komentar_Bersih": "kini aja sih mobile bca klasik kayak dipertahanin ngekeep basis nasabah bca konservatif duit biar ga ubah",
    "sentiment": "netral"
  },
  {
    "Username": "Bermainangin",
    "Komentar": "Oiya gatau knp buat qris ini gak ada potongan apa2 sih",
    "Komentar_Bersih": "oiya gatau knp qris gak potong sih",
    "sentiment": "netral"
  },
  {
    "Username": "GalaksiAndromeda",
    "Komentar": "yang berarti murni cashless payment bermasalah. Harus tetap ada pilihan cash.",
    "Komentar_Bersih": "murni cashless payment masalah pilih cash",
    "sentiment": "netral"
  },
  {
    "Username": "flag9801",
    "Komentar": "did you shit green\n\ni have once almost overdosed on promag(6 pill in one sitting as a boy)",
    "Komentar_Bersih": "did you shit green i have once almost overdosed on promag pill in one sitting as a boy",
    "sentiment": "netral"
  },
  {
    "Username": "dhupee_haj",
    "Komentar": "Tbh ku mau belajar ini sih, for my own need",
    "Komentar_Bersih": "tbh ku ajar sih for my own need",
    "sentiment": "netral"
  },
  {
    "Username": "motoxim",
    "Komentar": "Ini bisa diendepin gak sih, jadi misalkan tiap 3 hari atau seminggu baru tarik?",
    "Komentar_Bersih": "diendepin gak sih minggu tarik",
    "sentiment": "netral"
  },
  {
    "Username": "beelzebub-rising",
    "Komentar": "Yes, it is indeed the Pendidikan, SPBU, and Bansos",
    "Komentar_Bersih": "yes it is indeed the didik spbu and bansos",
    "sentiment": "netral"
  },
  {
    "Username": "Much_Oil9487",
    "Komentar": "Kl image assetsnya dr designernya ga konsisten buat tiap page bakal lebih nyebelin lagi karena asset imagenya jd byk bgt\n\nMisal icon notif di home page pake image A tapi icon notif di page profile pake icon B, trs icon lain jg begitu wkwkwk",
    "Komentar_Bersih": "kl image assetsnya dr designernya ga konsisten page nyebelin asset imagenya jd byk bgt icon notif home page pake image a icon notif page profile pake icon b trs icon jg wkwkwk",
    "sentiment": "netral"
  },
  {
    "Username": "ArchTemperedKoala",
    "Komentar": "Lol no at most 3 times a day, as an adult nonetheless..",
    "Komentar_Bersih": "lol no at most times a day as an adult nonetheless",
    "sentiment": "netral"
  },
  {
    "Username": "rulakhy",
    "Komentar": "Sama, gw yang sempat kerja di payment gateway aja ga paham-paham flow pembayaran dan settlement ini 🤦",
    "Komentar_Bersih": "gw kerja payment gateway aja ga pahampaham flow bayar settlement",
    "sentiment": "netral"
  }
]
